app/Controllers/Productos.php

SELECT *
FROM `productos`
---
    public function index()
    {
       //Instanciar el modelo ProductosModel
       $productosModel = new ProductosModel();

        //Obtener todos los datos de la base de datos
       $productos =$productosModel->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '3'
---
    public function detalle($id)
    {
        $productosModel = new ProductosModel();
        $producto = $productosModel->find($id);